Revit 2027 API
BumpMap.BumpmapType Property
 The property labeled "Bump Type" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string BumpmapType { get; }
Public Shared ReadOnly Property BumpmapType As String
	Get
public:
static property String^ BumpmapType {
	String^ get ();
}
static member BumpmapType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "BumpmapType".
See Also
Reference
BumpMap Class
Autodesk.Revit.DB.Visual Namespace